Revit 2024 API
VertexBuffer Members
The VertexBuffer type exposes the following members.
Constructors
Name | Description
VertexBuffer
 Constructs the vertex buffer with the given capacity, measured in floats.
Methods
Name | Description
Dispose
Releases all resources used by the VertexBuffer
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetMappedHandle
 Gets a handle to the buffer's memory that has been mapped. Writing data to the buffer using the handle is an alternative to using stream objects.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetVertexStreamPosition
 Gets a stream that can be used to write vertices of type VertexPosition into the buffer.
GetVertexStreamPositionColored
 Gets a stream that can be used to write vertices of type VertexPositionColored into the buffer.
GetVertexStreamPositionNormal
 Gets a stream that can be used to write vertices of type VertexPositionNormal into the buffer.
GetVertexStreamPositionNormalColored
 Gets a stream that can be used to write vertices of type VertexPositionNormalColored into the buffer.
IsValid
 Tests whether the buffer is valid for rendering.
Map
 Maps a portion of the buffer into memory, so that vertex data can be written into it. (see VertexStream).
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Unmap
 Unmaps the buffer, so that it can be used for rendering.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
VertexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace